colors_bgr = ((0, 0, 255), (0, 255, 0), (0, 255, 255), (255, 0, 0), (255, 0, 255), (255, 255, 0), (203, 192, 255),
              (147, 20, 255), (214, 112, 218), (221, 160, 221), (128, 0, 128), (130, 0, 75), (219, 112, 147),
              (139, 0, 0), (255, 105, 65), (255, 144, 30), (250, 206, 135), (255, 191, 0), (160, 158, 95),
              (170, 255, 127), (113, 179, 60), (0, 128, 0), (0, 255, 127), (0, 128, 128), (205, 250, 255),
              (170, 232, 238), (0, 215, 255), (32, 165, 218), (0, 165, 255), (30, 105, 210), (19, 69, 139),
              (114, 128, 250), (0, 0, 128))

colors_rgb = ((255, 0, 0), (0, 255, 0), (255, 255, 0), (0, 0, 255), (255, 0, 255), (0, 255, 255), (255, 192, 203),
              (255, 20, 147), (218, 112, 214), (221, 160, 221), (128, 0, 128), (75, 0, 130), (147, 112, 219),
              (0, 0, 139), (65, 105, 255), (30, 144, 255), (135, 206, 250), (0, 191, 255), (95, 158, 160),
              (127, 255, 170), (60, 179, 113), (0, 128, 0), (127, 255, 0), (128, 128, 0), (255, 250, 205),
              (238, 232, 170), (255, 215, 0), (218, 165, 32), (255, 165, 0), (210, 105, 30), (139, 69, 19),
              (250, 128, 114), (128, 0, 0))

colors_name_en = ("Red", "Lime", "Yellow", "Blue", "Magenta", "Cyan", "Pink", "DeepPink", "Orchid", "Plum", "Purple",
                  "Indigo", "MediumPurple", "DarkBlue", "RoyalBlue", "DoderBlue", "LightSkyBlue", "DeepSkyBlu",
                  "CadetBlue", "Auqamarin", "SpringGreen", "Green", "Chartreuse", "Olive", "LemonChiffon",
                  "PaleGodenro", "Gold", "GoldEnrod", "Orange", "Chocolate", "SaddleBrown", "Salmon", "Maroon")

colors_name_ch = ("纯红", "酸橙绿", "纯黄", "纯蓝", "紫红", "青", "粉红", "深粉", "兰花紫", "李子", "紫", "靛青", "中紫", "深蓝",
                  "皇家蓝", "道奇蓝", "淡蓝", "深天蓝", "军校蓝", "碧绿", "春天绿", "纯绿", "查特酒绿", "橄榄", "柠檬薄纱", "灰秋麒麟",
                  "金", "秋麒麟", "橙", "巧克力", "马鞍棕", "鲑鱼肉", "栗")

colors_dict_en_rgb = dict(zip(colors_name_en, colors_rgb))
colors_dict_en_bgr = dict(zip(colors_name_en, colors_bgr))
colors_dict_ch_rgb = dict(zip(colors_name_ch, colors_rgb))
colors_dict_ch_bgr = dict(zip(colors_name_ch, colors_bgr))
